In [1]:
import numpy as np
import pandas as pd

## Text Data - String Methods

In [50]:
df = pd.DataFrame(data=[['Tyler DURDEN', 'HR', "manager", "$180,000", 55],
                        ['MARIA puder', "IT", "data analyst", "150000dolar", 28],
                        ['dorothy gale', "HR", "recruiter", "$120,000", 30],
                        ['Edmond Dantes', "IT", "data scientist", "$170,000","-"], 
                        ['Gregor SAMSA',"IT", "frontend developer", "120000dolar",32]],
                  columns=["name","dept", "job", "sales", "age"])

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   dept    5 non-null      object
 2   job     5 non-null      object
 3   sales   5 non-null      object
 4   age     5 non-null      object
dtypes: object(5)
memory usage: 328.0+ bytes

In [52]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [53]:
# Bir stringi küçük harfe dönüştürür
df.name.str.lower()

0     tyler durden
1      maria puder
2     dorothy gale
3    edmond dantes
4     gregor samsa
Name: name, dtype: object

In [54]:
# Bir stringi büyük harfe dönüştürür
df.name.str.upper()

0     TYLER DURDEN
1      MARIA PUDER
2     DOROTHY GALE
3    EDMOND DANTES
4     GREGOR SAMSA
Name: name, dtype: object

In [10]:
# İlk karakteri büyük harfe dönüştürür
df.name.str.title()

0     Tyler Durden
1      Maria Puder
2     Dorothy Gale
3    Edmond Dantes
4     Gregor Samsa
Name: name, dtype: object

In [11]:
# Her kelimenin ilk karakterini büyük harfe dönüştürür
df.name.str.capitalize()

0     Tyler durden
1      Maria puder
2     Dorothy gale
3    Edmond dantes
4     Gregor samsa
Name: name, dtype: object

In [12]:
# Büyük harfleri küçük, küçük harfleri büyük harfe dönüştürür
df.name.str.swapcase()

0     tYLER durden
1      maria PUDER
2     DOROTHY GALE
3    eDMOND dANTES
4     gREGOR samsa
Name: name, dtype: object

In [13]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [14]:
# Tüm karakterlerin alfabede yer alıp almadığını kontrol ederek True veya False değeri döndürür
df.job.str.isalpha()

0     True
1    False
2     True
3    False
4    False
Name: job, dtype: bool

In [15]:
# Tüm karakterlerin sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür
df.job.str.isnumeric()

0    False
1    False
2    False
3    False
4    False
Name: job, dtype: bool

In [16]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3    False
4      NaN
Name: age, dtype: object

In [17]:
df.age.astype("string").str.isnumeric()

0     True
1     True
2     True
3    False
4     True
Name: age, dtype: boolean

In [18]:
# Tüm karakterlerin harf veya sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür
df.sales.str.isalnum()

0    False
1     True
2    False
3    False
4     True
Name: sales, dtype: bool

In [19]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [20]:
# Bir stringin belirtilen değerle başladığını kontrol ederek True veya False değeri döndürür
df.job.str.startswith("f")

0    False
1    False
2    False
3    False
4     True
Name: job, dtype: bool

In [21]:
# Bir stringin belirtilen değerle bittiğini kontrol ederek True veya False değeri döndürür
df.job.str.endswith("st")

0    False
1     True
2    False
3     True
4    False
Name: job, dtype: bool

In [24]:
df[df.job.str.endswith("st")]                  # sonucumuzu dataframe de görmek için bu formatı kullanırız

            name dept             job        sales age
1    MARIA puder   IT    data analyst  150000dolar  28
3  Edmond Dantes   IT  data scientist     $170,000   -

In [22]:
df.job.str.contains("data")

0    False
1     True
2    False
3     True
4    False
Name: job, dtype: bool

In [23]:
# Bir alt dizinin bir dizede bulunup bulunmadığını kontrol ederek her bir öğe için True veya False değeri döndürür
df[df.job.str.contains("data")]

            name dept             job        sales age
1    MARIA puder   IT    data analyst  150000dolar  28
3  Edmond Dantes   IT  data scientist     $170,000   -

In [25]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [26]:
# str.rstrip(): Bir stringin sonundaki boşlukları temizler ve kırpılmış bir versiyonunu döndürür
df.sales.str.rstrip("dolar")

0    $180,000
1      150000
2    $120,000
3    $170,000
4      120000
Name: sales, dtype: object

In [27]:
df.sales.str.rstrip("dolar").str.lstrip("$")

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: sales, dtype: object

In [28]:
# tek satırda yazmak istersek 
# str.strip(): Bir stringin başındaki ve sonundaki boşlukları temizler ve kırpılmış bir versiyonunu döndürür
df.sales.str.strip("dolar$")

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: sales, dtype: object

In [29]:
# sonucu tek formatta görmek istersek
df.sales.str.strip("dolar$").str.replace(",", "")

0    180000
1    150000
2    120000
3    170000
4    120000
Name: sales, dtype: object

In [30]:
# object'ten float dönüşümü yapmak istersek 
df.sales.str.strip("dolar$").str.replace(",", "").astype(float)

0    180000.0
1    150000.0
2    120000.0
3    170000.0
4    120000.0
Name: sales, dtype: float64

In [31]:
df.sales = df.sales.str.strip("dolar$").str.replace(",", "").astype(float)
df

            name dept                 job     sales age
0   Tyler DURDEN   HR             manager  180000.0  55
1    MARIA puder   IT        data analyst  150000.0  28
2   dorothy gale   HR           recruiter  120000.0  30
3  Edmond Dantes   IT      data scientist  170000.0   -
4   Gregor SAMSA   IT  frontend developer  120000.0  32

In [33]:
# anlamsız değerleri nan yapalım
df.age = df.age.replace("-", np.nan)
df

            name dept                 job     sales   age
0   Tyler DURDEN   HR             manager  180000.0  55.0
1    MARIA puder   IT        data analyst  150000.0  28.0
2   dorothy gale   HR           recruiter  120000.0  30.0
3  Edmond Dantes   IT      data scientist  170000.0   NaN
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0

In [34]:
df.name.str.title().str.split()

0     [Tyler, Durden]
1      [Maria, Puder]
2     [Dorothy, Gale]
3    [Edmond, Dantes]
4     [Gregor, Samsa]
Name: name, dtype: object

In [35]:
df.name.str.title().str.split().str[0]

0      Tyler
1      Maria
2    Dorothy
3     Edmond
4     Gregor
Name: name, dtype: object

In [36]:
df.name.str.title().str.split().str[1]

0    Durden
1     Puder
2      Gale
3    Dantes
4     Samsa
Name: name, dtype: object

In [ ]:
# df["first_name"] = df.name.str.title().str.split().str[0]
# df["last_name"] = df.name.str.title().str.split().str[1]     aşağıdaki kod daha kısa yoldan

In [37]:
df["first_name"], df["last_name"] = [df.name.str.title().str.split().str[i] for i in range(2)]
df

            name dept                 job     sales   age first_name last_name
0   Tyler DURDEN   HR             manager  180000.0  55.0      Tyler    Durden
1    MARIA puder   IT        data analyst  150000.0  28.0      Maria     Puder
2   dorothy gale   HR           recruiter  120000.0  30.0    Dorothy      Gale
3  Edmond Dantes   IT      data scientist  170000.0   NaN     Edmond    Dantes
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0     Gregor     Samsa

In [38]:
df.drop("name", axis=1, inplace=True)

In [39]:
df

  dept                 job     sales   age first_name last_name
0   HR             manager  180000.0  55.0      Tyler    Durden
1   IT        data analyst  150000.0  28.0      Maria     Puder
2   HR           recruiter  120000.0  30.0    Dorothy      Gale
3   IT      data scientist  170000.0   NaN     Edmond    Dantes
4   IT  frontend developer  120000.0  32.0     Gregor     Samsa

In [40]:
# str.find(): Bir stringde belirtilen bir değeri arar ve bulunduğu konumun indeksini döndürür
df.job.str.find("er")

0     5
1    -1
2     7
3    -1
4    16
Name: job, dtype: int64

In [41]:
# str.findall(): Bir satırdaki tüm örneklerin bir listesini döndürür
df.job.str.findall("developer")

0             []
1             []
2             []
3             []
4    [developer]
Name: job, dtype: object

In [42]:
df.job.str.findall("d")

0        []
1       [d]
2        []
3       [d]
4    [d, d]
Name: job, dtype: object

In [43]:
df.job.str.findall("d").apply(len)

0    0
1    1
2    0
3    1
4    2
Name: job, dtype: int64

In [44]:
df["skills"] = [[], ["Python", "Tableau", "SQL"], [], ["ML", "DL", "NLP"], ["React", "Django"]]
df["Skills"] = [[], "Python, Tableau, SQL", [], ["ML", "DL", "NLP"], ["React", "Django"]]

df

,dept,job,sales,age,first_name,last_name,skills,Skills
0,HR,manager,180000.0,55.0,Tyler,Durden,[],[]
1,IT,data analyst,150000.0,28.0,Maria,Puder,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,HR,recruiter,120000.0,30.0,Dorothy,Gale,[],[]
3,IT,data scientist,170000.0,NaN,Edmond,Dantes,"[ML, DL, NLP]","[ML, DL, NLP]"
4,IT,frontend developer,120000.0,32.0,Gregor,Samsa,"[React, Django]","[React, Django]"

In [45]:
df.skills.str.join(",")

0
1    Python,Tableau,SQL
2
3             ML,DL,NLP
4          React,Django
Name: skills, dtype: object

In [46]:
df.Skills.str.join(",")

0
1    P,y,t,h,o,n,,, ,T,a,b,l,e,a,u,,, ,S,Q,L
2
3                                  ML,DL,NLP
4                               React,Django
Name: Skills, dtype: object

In [47]:
# yukarıdaki her iki durum için tek satırda bu işlemi gerçekleştirebiliriz
df.Skills.apply(lambda item: ",".join(item) if type(item)== list else item)

0
1    Python, Tableau, SQL
2
3               ML,DL,NLP
4            React,Django
Name: Skills, dtype: object

In [48]:
df.Skills = df.Skills.apply(lambda item: ",".join(item) if type(item)== list else item)

df.Skills

0
1    Python, Tableau, SQL
2
3               ML,DL,NLP
4            React,Django
Name: Skills, dtype: object